Revit 2024 API
Leader Members
The Leader type exposes the following members.
Methods
Name | Description
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Anchor
 Anchor point of the Leader
Elbow
 Elbow point of the Leader.
End
 End point of the Leader.
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LeaderShape
 Geometric style of the leader
See Also
Leader Class
Autodesk.Revit.DB Namespace